a(a () {N
  // AaN
  a a (a, a, a, a) {N
    a (a % 0 > 0 && a % 0 < 0) {N
      a a;N
    }N
    a (a % 0 === 0) {N
      a a;N
    }N
    a (a % 0 > 0 && a % 0 < 0) {N
      a a;N
    }N
    a a;N
  }N
N
  a {N
    aAa: a () {N
      a 'Неможливо завантажити результати';N
    },N
    aAaAa: a (a) {N
      a aAa = a.a.a - a.a;N
      a 'Будь ласка, видаліть ' + aAa + ' ' +N
        a(a.a, 'літеру', 'літери', 'літер');N
    },N
    aAaAa: a (a) {N
      a aAa = a.a - a.a.a;N
      a 'Будь ласка, введіть ' + aAa + ' або більше літер';N
    },N
    aAa: a () {N
      a 'Завантаження інших результатів...';N
    },N
    aAa: a (a) {N
      a 'Ви можете вибрати лише ' + a.a + ' ' +N
        a(a.a, 'пункт', 'пункти', 'пунктів');N
    },N
    aAa: a () {N
      a 'Нічого не знаидено';N
    },N
    a: a () {N
      a 'Пошук...';N
    }N
  };N
});N
