a(a () {N
  // AaN
  a {N
    aAa: a () {N
      a '결과를 불러올 수 없습니다.';N
    },N
    aAaAa: a (a) {N
      a aAa = a.a.a - a.a;N
N
      a a = '너무 깁니다. ' + aAa + ' 글자 지워주세요.';N
N
      a a;N
    },N
    aAaAa: a (a) {N
      a aAa = a.a - a.a.a;N
N
      a a = '너무 짧습니다. ' + aAa + ' 글자 더 입력해주세요.';N
N
      a a;N
    },N
    aAa: a () {N
      a '불러오는 중...';N
    },N
    aAa: a (a) {N
      a a = '최대 ' + a.a + '개까지만 선택 가능합니다.';N
N
      a a;N
    },N
    aAa: a () {N
      a '결과가 없습니다.';N
    },N
    a: a () {N
      a '검색 중...';N
    }N
  };N
});N
