a aN
a a0N
a aN
a a_a a *N
N
# Создаем базу данныхN
a = a0.a("a.a")N
a a:N
    a = a.a()N
    a.a("A A A A Aa")N
    a.a("A A Aa(Aa A, AaAa A, Aa A, a A, Aa A, "N
                "Aa A, Aa A, Aa A, A A, A_A A, A_A_A A, A A, A A, A A)")N
a.a()N
N
# a a .N
# a a -a "a a"N
# a a -a a aN
N
a = a.AaAa('0:AaAaAaAaAaA0A-AaAaA')N
N
N
# Создание БД с данными о персонажеN
a a(a):N
    a = a0.a("a.a")N
    a = a.a_a.a_aN
    a a:N
        a = a.a()N
        a.a("""A A Aa A(?,?,?,?,?,?,?,?,?,?,?,?,?,?);""",N
                    (a(a.a_a.a), a(a), a('0'), a('0'), a('0'), a('0'), a('0'),N
                     a('0'), a('0'), a('0'), a('0'), a('0'), a('0'), a('0')))N
    a.a()N
N
N
# инициализация и вывод стартовых кнопокN
@a.a_a(a=['a'])N
a a_a(a):N
    a = a.a.AaAaAa(Aa, Aa)N
    a = a.a.AaAa('Бои ⚔')N
    a = a.a.AaAa('Профиль 🎫')N
    a = a.a.AaAa('Путешествовать')N
    a = a.a.AaAa('Прокачать 🏅')N
    a.a(a, a)N
    a.a(a, a)N
    a.a_a(a.a_a.a, "Выбери деиствие:", a_a=a)N
    a = a0.a("a.a")N
    a a:N
        a = a.a()N
        a.a("A * A Aa A Aa=" + a(a.a_a.a))N
        a = a.a()N
    a.a()N
    a a a:N
        a.a_a_a(a(a))N
N
N
# Вывод всех пользователеи и их данныхN
a a_a(a):N
    a = a0.a("a.a")N
    a a:N
        a = a.a()N
        a.a("A * A Aa")N
        a = a.a()N
        a a a a:N
            a.a_a(a.a_a.a, a(a))N
N
N
# Кнопки предлагающие на выбор одну из прокачиваемых характеристикN
a a_a_a(a):N
    a = a0.a("a.a")N
    a a:N
        a = a.a()N
        a.a("A * A Aa A Aa=" + a(a.a_a.a))N
        a = a.a()N
        a.a()N
    a a a:N
        a.a_a(a.a_a.a, "Привет, вижу ты здесь впервые, нажми /a")N
    a:N
        a_a = a.a.AaAaAa(Aa, Aa)N
        a = a.a.AaAa('💪 Сила')N
        a = a.a.AaAa('📚 Интелект')N
        a = a.a.AaAa('🤸 ‍Ловкость')N
        a = a.a.AaAa('🧘 ‍Выносливость')N
        a = a.a.AaAa('🎯 Удача')N
        a = a.a.AaAa('Назад')N
        a_a.a(a, a, a)N
        a_a.a(a, a, a)N
        a.a_a(a.a_a.a, "Стоимость прокачки: " + a(0 * a[0][0]) + "💰")N
        a.a_a(a.a_a.a, "Что желаете прокачать " + a(a[0][0]) + "?\a",N
                         a_a=a_a)N
N
N
# Функция повышения оннои характеристикиN
a a_a_a_a(a):N
    a = a0.a("a.a")N
    a a:N
        a = a.a()N
        a.a("A * A Aa A Aa=" + a(a.a_a.a))N
        a = a.a()N
        a_a = ""N
        a_a_a = 0 * a[0][0]N
        a a[0][0] >= a_a_a:N
            a a.a == "💪 Сила" a a.a == "Сила":N
                a_a = "Aa"N
            a a.a == "📚 Интелект" a a.a == "Интелект":N
                a_a = "a"N
            a a.a == "🤸 ‍Ловкость" a a.a == "‍Ловкость":N
                a_a = "Aa"N
            a a.a == "🧘 ‍Выносливость" a a.a == "‍Выносливость":N
                a_a = "Aa"N
            a a.a == "🎯 Удача" a a.a == "Удача":N
                a_a = "Aa"N
        a a_a != "" a a[0][0] >= a_a_a:N
            a a_a == "Aa":N
                a.a(N
                    "A Aa A " + a_a + "=" + a_a + "+0 A  Aa=" + a(a.a_a.a))N
                a.a(N
                    "A Aa A Aa = Aa-" + a(a_a_a) + " A  Aa=" + a(a.a_a.a))N
                a.a("A Aa A A = A+0 A  Aa=" + a(a.a_a.a))N
                a.a("A Aa A A = A+0 A  Aa=" + a(a.a_a.a))N
                a.a_a(a.a_a.a, "Выбранная характеристика повысилась")N
                a.a_a_a(a.a(a))N
            a a_a == "Aa":N
                a.a(N
                    "A Aa A " + a_a + "=" + a_a + "+0 A  Aa=" + a(a.a_a.a))N
                a.a(N
                    "A Aa A Aa = Aa-" + a(a_a_a) + " A  Aa=" + a(a.a_a.a))N
                a.a("A Aa A A = A+0 A  Aa=" + a(a.a_a.a))N
                a.a_a(a.a_a.a, "Выбранная характеристика повысилась")N
                a.a_a_a(a.a(a))N
            a a_a == "Aa":N
                a.a(N
                    "A Aa A " + a_a + "=" + a_a + "+0 A  Aa=" + a(a.a_a.a))N
                a.a(N
                    "A Aa A Aa = Aa-" + a(a_a_a) + " A  Aa=" + a(a.a_a.a))N
                a.a("A Aa A A = A+0 A  Aa=" + a(a.a_a.a))N
                a.a_a(a.a_a.a, "Выбранная характеристика повысилась")N
                a.a_a_a(a.a(a))N
            a a_a == "Aa" a a_a == "a":N
                a.a(N
                    "A Aa A " + a_a + "=" + a_a + "+0 A  Aa=" + a(a.a_a.a))N
                a.a(N
                    "A Aa A Aa = Aa-" + a(a_a_a) + " A  Aa=" + a(a.a_a.a))N
                a.a_a(a.a_a.a, "Выбранная характеристика повысилась")N
                a.a_a_a(a.a(a))N
        a:N
            a.a_a(a.a_a.a, "Вам не хватает ❌денег❌ для прокачки характеристики")N
            a.a_a_a(a.a(a))N
    a.a()N
N
N
# Рандомныи монстр в зависимости от локацииN
# a a_a_a(a):N
#    a = a0.a("a.a")N
#    a a:N
#        a = a.a()N
#       a.a("A * A Aa A Aa=" + a(a.a_a.a))N
#       a = a.a()N
#        A = Aa_a(a[0][0])N
#  a A.a_a_a()N
N
N
# процесс повышения уровня персонажаN
a a_a_a(a_a_a, a_a, a):N
    a = a0.a("a.a")N
    a a:N
        a = a.a()N
        a.a("A * A Aa A Aa=" + a(a.a_a.a))N
        a = a.a()N
        a_a = a((a_a - a[0][0] + 0) + (a[0][0] / 0 * a.a(0, 0)))N
        a_a_a = a_a_a + "\aполучено опыта: " + a(a_a)N
        a.a(N
            "A Aa A A_A = A_A+" + a(a_a) + " A  Aa=" + a(a.a_a.a))N
        a_a_a = 0N
        a (a[0][0] + a_a) >= a[0][0]:N
            a.a(N
                "A Aa A A_A = A_A-" + a(a[0][0]) + " A  Aa=" + a(a.a_a.a))N
            a.a("A Aa A A_A_A = A_A_A*0 A  Aa=" + a(a.a_a.a))N
            a.a("A Aa A A = A+0 A  Aa=" + a(a.a_a.a))N
            a.a("A Aa A A = A+0 A  Aa=" + a(a.a_a.a))N
            a.a("A Aa A A = A+0 A  Aa=" + a(a.a_a.a))N
            a_a_a = a_a_a + "\a🎊🎊Ваш уровень повышен🎊🎊 \aЗдоровье увеличено на 0❤ и урон " \N
                                                    "увеличен на 0🔪 "N
            a_a_a = a_a_a + "\aВаш уровень: " + a(a[0][0] + 0) + "   " \N
                                + a(a[0][0] + a_a - a[0][0]) + "/" + a(a[0][0] * 0)N
            a_a_a = 0N
        a a_a_a == 0:N
            a_a_a = a_a_a + "\aВаш уровень: " + a(a[0][0]) + "   " \N
                                + a(a[0][0] + a_a) + "/" + a(a[0][0])N
        a_a = a(a_a * a.a(0, 0))N
        a.a("A Aa A Aa = Aa+" + a(a_a) + " A  Aa=" + a(a.a_a.a))N
        a_a_a = a_a_a + "\aполучено: " + a(a[0][0]) + "+" + a(a_a) + " золота💰"N
        a.a_a(a.a_a.a, a_a_a)N
    a.a()N
N
N
# Создание уровня и A босса в зависимости от локацииN
a a_a_a(a_a_a, a_a_a, a):N
    a = a0.a("a.a")N
    a a:N
        a = a.a()N
        a.a("A * A Aa A Aa=" + a(a.a_a.a))N
        a = a.a()N
        a.a()N
    a_a = a(a[0][0] * a.a(0, 0)) + a[0][0]N
    a_a = a_a * a.a(0, 0)N
    a a[0][0] == 0:N
        a_a = a_a + 0N
    a a[0][0] == 0:N
        a_a = a_a + 0N
    a_a = a[0][0]N
    a_a = a((a[0][0] + a[0][0] + a[0][0]) / 0) - 0N
    a_a_a = a_a_a + a(a[0][0]) + ": " + a(a_a) + "❤ / " + a(N
        a_a_a) + " " \N
                        + a(a_a) + " уровня: " + a(a_a) + "❤ \a\a"N
    a a_a > a_a:N
        a = 0N
        a_a_a = a_a_a + a(a[0][0]) + " Заметил монстра первым\a"N
    a:N
        a = 0N
        a_a_a = a_a_a + "Герои не заметил подкрадывающегося монстра\a"N
    a a_a >= 0 a a_a >= 0:N
        a_a = a(a[0][0] * a.a() * 0)N
        a_a = a(0 + a_a * a.a() * 0)N
        a a == 0:N
            a = 0N
            a_a = a_a - a_aN
            a_a_a = a_a_a + a(a[0][0]) + " ⚔ " + a(a_a_a) \N
                                + " нанося " + a(a_a) + " урона\a❤ у монстра осталось " + a(a_a) + "\a"N
        a a == 0:N
            a = 0N
            a_a = a_a - a_aN
            a_a_a = a_a_a + a(a_a_a) + " ⚔ героя нанося " \N
                                + a(a_a) + " урона\a❤ у героя осталось " + a(a_a) + "\a"N
    a a_a <= 0 a a_a >= 0:N
        a_a_a = a_a_a + "\a🎊Герои победил🎊"N
        a_a_a(a_a_a, a_a, a)N
    a a_a <= 0 a a_a >= 0:N
        a_a_a = a_a_a + "\a☠Герои проиграл☠"N
        a.a_a(a.a_a.a, a_a_a)N
N
N
# Начало генерации битвы, на данном этапе подбирается монстр и сообщение передается след. функцииN
a a(a):N
    a = a0.a("a.a")N
    a a:N
        a = a.a()N
        a.a("A * A Aa A Aa=" + a(a.a_a.a))N
        a = a.a()N
        a.a()N
    a a a:N
        a.a_a(a.a_a.a, "Привет, вижу ты здесь впервые, нажми /a")N
    a:N
        A = Aa_a(a[0][0])N
        a_a_a = A.a_a_a()N
        a_a_a = "на вас напал " + a(a_a_a) + "\a"N
        a_a_a(a_a_a, a_a_a, a)N
N
N
# Картинка карты мираN
@a.a_a(a=['a'])N
a a(a):N
    a.a_a(a.a_a.a, a=a('Aa.a', 'a'))N
N
# реакция бота на текс путем проверки полученного сообщенияN
@a.a_a(a_a=['a'])N
a a_a_a(a):N
    a a.a == "Привет" a a.a == "привет":N
        a = a0.a("a.a")N
        a a:N
            a = a.a()N
            a.a("A * A Aa A Aa=" + a(a.a_a.a))N
            a = a.a()N
        a.a()N
        a a a:N
            a.a_a(a.a_a.a, "Привет, вижу ты здесь впервые, нажми /a")N
        a:N
            a.a_a(a.a_a.a, "Привет, " + a(a[0][0]) + ", чем я могу тебе помочь?")N
    a a.a == "Пользователи" a a.a == "пользователи":N
        a.a_a_a(a_a(a))N
    a a.a == "Профиль" a a.a == "профиль" a a.a == "Профиль 🎫":N
        a.a_a_a(a.a_a(a))N
    a a.a == "Прокачать 🏅" a a.a == "Прокачать" a a.a == "прокачать":N
        a.a_a_a(a_a_a(a))N
    a a.a == "Назад" a a.a == "назад" a a.a == "Не путешествовать":N
        a.a_a_a(a.a(a))N
    a a.a == "💪 Сила" a a.a == "Сила":N
        a.a_a_a(a_a_a_a(a))N
    a a.a == "📚 Интелект" a a.a == "Интелект":N
        a.a_a_a(a_a_a_a(a))N
    a a.a == "🤸 ‍Ловкость" a a.a == "‍Ловкость":N
        a.a_a_a(a_a_a_a(a))N
    a a.a == "🧘 ‍Выносливость" a a.a == "‍Выносливость":N
        a.a_a_a(a_a_a_a(a))N
    a a.a == "🎯 Удача" a a.a == "Удача":N
        a.a_a_a(a_a_a_a(a))N
    a a.a == "Бои ⚔" a a.a == "Бои":N
        a.a_a_a(a(a))N
    a a.a == "Путешествовать" a a.a == "путешествовать":N
        a.a_a_a(a.a_a_a(a))N
    a a.a == "Деревня" a a.a == "Забытые руины" a a.a == "Озеро чудовищ" \N
            a a.a == "Огненныи грот" \N
            a a.a == "Вернуться в город" a a.a == "Заброшенная башня" a a.a == "Оазис" \N
            a a.a == "Логово Кракена" a a.a == "Логово Дракона":N
        a.a_a_a(a.a_a(a))N
N
N
a.a()N
