#a <a>N
N
// Взявши за основу програму із завдання 0, додаите метод типуN
// a, якии називається aAa (), до класів a і a. Припустимо, книга, вN
// якіи більше 0 сторінок, або касета з часом програвання якоі більше 0N
// хвилин, будуть вважатися об'єктами з перевищенням розміру. До цієі функцііN
// можна звертатися з a(), а результат іі роботи виводити у вигляді рядкаN
// «Перевищення розміру!» Для відповідних книг і касет. Припустимо, об'єктиN
// класів a і a повинні бути доступні через покажчики на них, щоN
// зберігаються в масиві типу a.N
N
a a a;N
N
a aN
{N
a:N
  a a;N
  a a;N
N
a:N
  a()N
  {N
    a->a = "";N
    a->a = 0.0;N
  }N
  a a()N
  {N
    a << "a[a] = ";N
    a >> a->a;N
    a << "a[a] = ";N
    a >> a->a;N
    a << a;N
  }N
  a a() { a << "Aa: " << a->a << ", a: " << a->a << a; }N
};N
a a : a aN
{N
a:N
  a a;N
N
a:N
  a() : a() { a->a = 0.0; }N
  a a()N
  {N
    a << "a[a] = ";N
    a >> a->a;N
  }N
  a a() { a << "Aa: " << a->a << a; }N
  a aAa() { a a > 0; }N
};N
N
a a : a aN
{N
a:N
  a a;N
N
a:N
  a() : a() { a->a = 0; }N
  a a()N
  {N
    a << "a[a] = ";N
    a >> a->a;N
  }N
  a a() { a << "Aa: " << a->a << a; }N
  a aAa() { a a > 0; }N
};N
N
a a()N
{N
  a *a[0];N
N
  a << "Aa a" << a;N
  a (a a = 0; a < 0; a++)N
  {N
    a (a < 0)N
    {N
      a *a = a a();N
      a->a::a();N
      a->a();N
      a (a->aAa())N
        a << "Aa!" << a;N
      a[a] = a;N
    }N
    aN
    {N
      a *a = a a();N
      a->a::a();N
      a->a();N
      a (a->aAa())N
        a << "Aa!" << a;N
      a[a] = a;N
    }N
  }N
  a << "Aa a a" << a;N
N
  a << "Aa a a a a:" << a;N
  a (a a = 0; a < 0; a++)N
    a[a]->a();N
N
  a("a");N
  a 0;N
}N
