#a <a>N
#a <a.a>N
N
a a a;N
N
// Базовии клас (точки у двовимірніи площині з цілочисельними координатами):N
// Конструктори: за замовчуванням, з параметрами та копіювання.N
// Деструктор. Функціі: обчислення відстані між точками;N
// додавання координат двох точок; введення - виведення на екран; перевірка збіжності двох точок.N
// Похіднии клас: пікселів на екрані (точки, які мають колір).N
N
a AaN
{N
a:N
  a a, a;N
N
a:N
  Aa() { a->a = a->a = 0; }N
  Aa(a a, a a)N
  {N
    a->a = a;N
    a->a = a;N
  }N
  Aa(Aa &a)N
  {N
    a->a = a.a;N
    a->a = a.a;N
  }N
  a aAa(Aa &a) { a a(a(a.a - a->a, 0) + a(a.a - a->a, 0)); }N
  a a(Aa &a)N
  {N
    a->a += a.a;N
    a->a += a.a;N
  }N
  a a()N
  {N
    a << "a = ";N
    a >> a->a;N
    a << "a = ";N
    a >> a->a;N
  }N
  a a() { a << "a = " << a->a << ", a = " << a->a << a; }N
  a aAa(Aa &a) { a a->a == a.a && a->a == a.a; }N
};N
N
a AaAa : a AaN
{N
a:N
  a a a;N
N
a:N
  a a aAa() { a a->a; }N
  a aAa(a a a) { a->a = a; }N
};N
N
a a()N
{N
  a();N
  a 0;N
}N
